/**
 * holiday and special events from https://github.com/ilius/starcal/blob/main/plugins
 */
export const holidays = {
  jalali: {
    "1-1": "آغاز نوروز",
    "1-2": "عید نوروز",
    "1-3": "عید نوروز",
    "1-4": "عید نوروز",
    "1-12": "روز جمهوری اسلامی ایران",
    "1-13": "روز طبیعت",
    "3-14": "رحلت حضرت امام خمینی رهبر کبیر انقلاب اسلامی(۱۳۶۸ ه‍.ش)",
    "3-15": "قیام خونین ۱۵ خرداد(۱۳۴۲ ه‍.ش)",
    "11-22": "پیروزی انقلاب اسلامی ایران و سقوط نظام شاهنشاهی(۱۳۵۷ ه‍.ش)",
    "12-29": "روز ملی شدن صنعت نفت ایران(۱۳۲۹ ه‍.ش)",
  },
  hijri: {
    "1-9": "تاسوعای حسینی",
    "1-10": "عاشورای حسینی",
    "2-20": "اربعین حسینی",
    "2-28":
      "رحلت حضرت رسول اکرم(ص)(۱۱ ه‍‍.ق) – شهادت حضرت امام حسن مجتبی(ع)(۵۰ ه‍‍.ق)",
    "2-30": "شهادت حضرت امام رضا(ع)(۲۰۳ ه‍‍.ق)",
    "3-8":
      "شهادت حضرت امام حسن عسکری(ع)(۲۶۰ ه‍‍.ق) و آغاز امامت حضرت ولی‌عصر (عج)",
    "3-17":
      "ولادت حضرت رسول اکرم(ص)(۵۳ سال قبل از هجرت) و روز اخلاق و مهرورزی – ولادت حضرت امام جعفر صادق(ع) مؤسس مذهب جعفری(۸۳ ه‍‍.ق)",
    "6-3": "شهادت حضرت فاطمهٔ زهرا(س)(۱۱ ه‍‍.ق)",
    "7-13":
      "ولادت حضرت امام علی(ع)(۲۳ سال قبل از هجرت) – روز پدر – آغاز ایام‌البیض(اعتکاف)",
    "7-27": "مبعث حضرت رسول اکرم(ص)(۱۳ سال قبل از هجرت)",
    "8-15": "ولادت حضرت قائم(عج)(۲۵۵ ه‍‍.ق) و روز جهانی مستضعفان",
    "9-21": "شهادت حضرت امام علی(ع)(۵۴۰ ه‍‍.ق)",
    "10-1": "عید سعید فطر",
    "10-2": "عید سعید فطر",
    "10-25": "شهادت حضرت امام جعفر صادق(ع)(۱۴۸ ه‍‍.ق)",
    "12-10": "عید سعید قربان – آغاز دههٔ امامت و ولایت",
    "12-18": "عید سعید غدیر خم(۱۰ ه‍‍.ق)",
  },
};
